# Specifications - Database
* Stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 & 2 of the project, and wants you to create a MySQL database for them.

* I will normalize the tables as best I can before adding them to the new database.

    * Note: an important exception to their request is that they would like you to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).  
    * You only need to keep the imdb_id, revenue, budget, and certification columns

## Genre
### Normalization
* Convert the single string of genres from title basics into 2 new tables.
    * title_genres: with the columns:
        - tconst
        - genre_id
    * genres:
        - genre_id
        - genre_name

In [14]:
#imports
import pandas as pd
import numpy as np
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
connection_str = "mysql+pymysql://root:root@localhost/Movies"

In [15]:
engine = create_engine(connection_str)
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

In [16]:
df = pd.read_csv('Data/basics.csv.gz', low_memory = False)

The genres column needs to be split into separate genres:

In [17]:
df['genres']

0           Comedy,Fantasy,Romance
1                            Drama
2                            Drama
3             Comedy,Horror,Sci-Fi
4            Horror,Music,Thriller
                   ...
79156                        Drama
79157         Comedy,Drama,Fantasy
79158                        Drama
79159    Action,Adventure,Thriller
79160                Drama,History
Name: genres, Length: 79161, dtype: object

In [18]:
df['genre-split'] = df['genres'].str.split(',')
df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genre-split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"
...,...,...,...,...,...,...,...,...,...,...
79156,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
79157,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
79158,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
79159,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
79160,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

In [19]:
exploded_genres = df.explode('genre-split')
exploded_genres[['tconst', 'primaryTitle', 'genre-split']]

,tconst,primaryTitle,genre-split
0,tt0035423,Kate & Leopold,Comedy
0,tt0035423,Kate & Leopold,Fantasy
0,tt0035423,Kate & Leopold,Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,Drama
2,tt0069049,The Other Side of the Wind,Drama
...,...,...,...
79159,tt9916190,Safeguard,Action
79159,tt9916190,Safeguard,Adventure
79159,tt9916190,Safeguard,Thriller
79160,tt9916362,Coven,Drama
79160,tt9916362,Coven,History

In [20]:
unique_genres = sorted(exploded_genres['genre-split'].dropna().unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [21]:
title_genres = exploded_genres[['tconst', 'genre-split']].copy()
title_genres

          tconst genre-split
0      tt0035423      Comedy
0      tt0035423     Fantasy
0      tt0035423     Romance
1      tt0062336       Drama
2      tt0069049       Drama
...          ...         ...
79159  tt9916190      Action
79159  tt9916190   Adventure
79159  tt9916190    Thriller
79160  tt9916362       Drama
79160  tt9916362     History

[147942 rows x 2 columns]

In [22]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [23]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genre-split'].map(genre_map)
title_genres = title_genres.drop(columns='genre-split')
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
79159  tt9916190         0
79159  tt9916190         2
79159  tt9916190        23
79160  tt9916362         7
79160  tt9916362        11

[147942 rows x 2 columns]

In [24]:
genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(), 
                            'Genre_ID': genre_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [25]:
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
79159  tt9916190         0
79159  tt9916190         2
79159  tt9916190        23
79160  tt9916362         7
79160  tt9916362        11

[147942 rows x 2 columns]

### Export Title_Genres Table to MySQL

In [26]:
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [27]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
title_genre_schema = {
    "tconst": String(key_len+1), 
    'genre_id':Integer()}

In [28]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=title_genre_schema,if_exists='replace',index=False)

Note: `title_genres` is a connector table and does not have a primary key.

In [29]:
q = """
SELECT *
FROM title_genres
LIMIT 5
"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

### Export Genres Table to MySQL

In [30]:
genre_lookup.dtypes

Genre_Name    object
Genre_ID       int64
dtype: object

In [31]:
genre_name_len = genre_lookup['Genre_Name'].fillna('').map(len).max()
genre_lookup_schema = {
    "Genre_Name": Text(genre_name_len+1),
    'Genre_ID':Integer()}

In [32]:
# Save to sql with dtype and index=False
genre_lookup.to_sql('genres',engine,dtype=genre_lookup_schema,if_exists='replace',index=False)

In [33]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

In [34]:
q = """
SELECT *
FROM genres
LIMIT 5
"""
pd.read_sql(q, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Basics

Now discard unnecessary information from basics table:
* "original_title" (we will use the primary title column instead)
* "isAdult" ("Adult" will show up in the genres so this is redundant information).
* "titleType" (every row will be a movie).
* "genres" and other variants of genre (genre is now represented in the 2 new tables described above.

In [35]:
df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genre-split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"
...,...,...,...,...,...,...,...,...,...,...
79156,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
79157,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
79158,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
79159,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
79160,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

In [36]:
df = df.drop(columns = ['originalTitle','isAdult', 'titleType', 'genres', 'genre-split'])
df

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0069049,The Other Side of the Wind,2018,NaN,122
3,tt0088751,The Naked Monster,2005,NaN,100
4,tt0093119,Grizzly II: Revenge,2020,NaN,74
...,...,...,...,...,...
79156,tt9914942,Life Without Sara Amat,2019,NaN,74
79157,tt9915872,The Last White Witch,2019,NaN,97
79158,tt9916170,The Rehearsal,2019,NaN,51
79159,tt9916190,Safeguard,2020,NaN,90
79160,tt9916362,Coven,2020,NaN,92

In [37]:
df.dtypes

tconst             object
primaryTitle       object
startYear           int64
endYear           float64
runtimeMinutes      int64
dtype: object

In [38]:
title_len = df['primaryTitle'].fillna('').map(len).max()
basics_schema = {
    "tconst": String(key_len+1), #key_len defined above
    "primaryTitle": Text(title_len+1),
    'startYear':Integer(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [39]:
df.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',index=False)

In [40]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [41]:
q = """
SELECT *
FROM title_basics
LIMIT 5
"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,None,70
2,tt0069049,The Other Side of the Wind,2018,None,122
3,tt0088751,The Naked Monster,2005,None,100
4,tt0093119,Grizzly II: Revenge,2020,None,74

## Ratings

In [42]:
ratings = pd.read_csv('Data/ratings.csv.gz', low_memory = False)

In [43]:
ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [44]:
ratings_schema = {
    "tconst": String(key_len+1), #key_len defined above
    "averageRating": Float(),
    'numVotes':Integer()}

In [45]:
ratings.to_sql('title_ratings',engine,dtype=ratings_schema,if_exists='replace',index=False)

In [46]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [47]:
q = """
SELECT *
FROM title_ratings
LIMIT 5
"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0035423            6.4     83497
1  tt0062336            6.4       161
2  tt0069049            6.7      7181
3  tt0088751            5.2       319
4  tt0093119            2.9      1103

## TMDB Data

In [48]:
tmdb_data = pd.read_csv('Final_Data/tmdb_ALL_results_combined.csv.gz', low_memory = False)
tmdb_data = tmdb_data[['imdb_id', 'revenue', 'budget', 'certification']]
tmdb_data

         imdb_id     revenue      budget certification
0      tt0113026         0.0  10000000.0           NaN
1      tt0113092         0.0         0.0           NaN
2      tt0116391         0.0         0.0           NaN
3      tt0118694  12854953.0    150000.0            PG
4      tt0118852         0.0         0.0             R
...          ...         ...         ...           ...
60075  tt9895024         0.0         0.0           NaN
60076  tt9896876         0.0         0.0         PG-13
60077  tt9898844         0.0         0.0           NaN
60078  tt9900940         0.0         0.0           NaN
60079  tt9907782   4588389.0         0.0             R

[60080 rows x 4 columns]

In [49]:
tmdb_data['certification'].value_counts(dropna = False)

NaN                                45457
R                                   6094
NR                                  3260
PG-13                               3223
PG                                  1434
G                                    444
NC-17                                156
Unrated                                5
-                                      1
UR                                     1
Not Rated                              1
ScreamFest Horror Film Festival        1
R                                      1
PG-13                                  1
10                                     1
Name: certification, dtype: int64

In [50]:
tmdb_data['certification'] = tmdb_data['certification'].str.strip()
tmdb_data['certification'].value_counts(dropna=False)

NaN                                45457
R                                   6095
NR                                  3260
PG-13                               3224
PG                                  1434
G                                    444
NC-17                                156
Unrated                                5
-                                      1
UR                                     1
Not Rated                              1
ScreamFest Horror Film Festival        1
10                                     1
Name: certification, dtype: int64

In [51]:
## fix certification col
repl_cert = {'UR':'NR',
             'Not Rated':'NR',
             'Unrated':'NR',
             '-':'NR',
             '10':np.nan,
             'ScreamFest Horror Film Festival':np.nan}
tmdb_data['certification'] = tmdb_data['certification'].replace(repl_cert)
tmdb_data['certification'].value_counts(dropna=False)

NaN      45459
R         6095
NR        3268
PG-13     3224
PG        1434
G          444
NC-17      156
Name: certification, dtype: int64

In [52]:
tmdb_data.dtypes

imdb_id           object
revenue          float64
budget           float64
certification     object
dtype: object

In [53]:
certification_len = tmdb_data['certification'].fillna('').map(len).max()
tmdb_schema = {
    "imdb_id": String(key_len+1), #key_len defined above
    "revenue": Float(),
    'budget':Float(),
    'certification': Text(certification_len+1)}

In [54]:
tmdb_data.to_sql('tmdb_data',engine,dtype=tmdb_schema,if_exists='replace',index=False)

In [55]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [56]:
q = """
SELECT *
FROM tmdb_data
LIMIT 5
"""
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0062336         0.0         0.0          None
2  tt0069049         0.0  12000000.0             R
3  tt0088751         0.0    350000.0          None
4  tt0093119         0.0   7500000.0          None

## Testing Database

In [57]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data